#### IndexLine Members

---

|  |
| --- |
| IndexLine Class   Constructors   Methods   Properties   See Also |

The  IndexLine  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | IndexLine | Constructs the line segment primitive. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  IndexPrimitive  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Index0 | The index of the line segment's first vertex. |
| Public property | Index1 | The index of the line segment's second vertex. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  IndexPrimitive  .) |

# See Also

IndexLine Class

Autodesk.Revit.DB.DirectContext3D Namespace